Repository: 84000/data-translation-memory
Catalog: Toh_134-The_Absorption_That_Encapsulates_All_Merit-v2.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པས་ནི་ཆོས་ཐམས་ཅད་མངོན་པར་འདུས་མ་བྱས་པ་དང་། ཡོད་པ་མ་ཡིན་པ་དང་། མ་བྱུང་བ་དང་། མ་སྐྱེས་པ་དང་། མ་འཐོན་པ་དང་། མཚན་མ་མེད་པ་དང་། མཚན་ཉིད་མེད་པ་དང་། མ་འོངས་པ་དང་། མ་སོང་བ་དང་། མི་གནས་པ་དང་། རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པ་དང་། རང་བཞིན་གྱིས་འོད་གསལ་བ་དང་། རང་བཞིན་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དང་། ཆོས་ཐམས་ཅད་ནམ་མཁའ་དང་འདྲ་བར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: The thus-gone ones have fully and perfectly awakened to all things’ uncompoundedness, lack of existence, lack of occurrence, lack of origination, lack of emergence, absence of marks, and absence of characteristics. They know that no phenomenon comes, goes, or remains. They know that phenomena are inherently pure, inherently luminous, inherently beyond suffering, and like space.

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་སམ། ཆོས་ཀྱི་ངོ་བོ་ཉིད་འགའ་ཞིག་ལ་དམིགས་པར་བྱེད་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་སྐུ་སླུ་བ་ཡིན་ནོ། །
en: So if bodhisattvas apprehend some phenomenon or the essential nature of some phenomenon, they disappoint the thus-gone ones, the foe-destroyers, the completely perfect buddhas.

source: ལྷའི་བུ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔས་ལྟ་བར་གྱུར་པ་ཐམས་ཅད་སྟོང་པ་ཉིད་དུ་ཡང་དག་པར་འདུ་བ་དང་།
en: “God, if on the other hand bodhisattvas understand that all views are encapsulated in the view of emptiness,

source: ལྟ་བར་གྱུར་པ་ཐམས་ཅད་མཚན་མ་མེད་པར་ཡང་དག་པར་འདུ་བ་དང་།
en: that all views are encapsulated in the view of signlessness,

source: ལྟ་བར་གྱུར་པ་ཐམས་ཅད་སྨོན་པ་མེད་པར་ཡང་དག་པར་འདུ་བ་དང་།
en: that all views are encapsulated in the view of wishlessness, and

source: ལྟ་བར་གྱུར་པ་ཐམས་ཅད་ཁམས་གསུམ་ལས་ཡང་དག་པར་འདས་པར་ཤེས་ནས་
en: that all views are entirely beyond the three realms, then

source: ཆོས་ཐམས་ཅད་མངོན་པར་འདུས་མ་བྱས་པ་དང་། ཡོད་པ་མ་ཡིན་པ་དང་། མ་བྱུང་བ་དང་། མ་སྐྱེས་པ་དང་། མ་འཐོན་པ་དང་། མཚན་མ་མེད་པ་དང་། མཚན་ཉིད་མེད་པ་དང་། མ་འོངས་པ་དང་། མ་སོང་བ་དང་། མི་གནས་པ་དང་། རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པ་དང་། རང་བཞིན་གྱིས་འོད་གསལ་བ་དང་། རང་བཞིན་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དང་། ཆོས་ཐམས་ཅད་ནམ་མཁའ་དང་འདྲ་བ་དང་། རང་བཞིན་གྱིས་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པར་ཤེས་ཏེ
en: they will understand all things’ uncompoundedness, lack of existence, lack of occurrence, lack of origination, lack of emergence, absence of marks, and absence of characteristics. They will understand that no phenomenon comes, goes, or remains. They will understand that phenomena are inherently pure, inherently luminous, inherently beyond suffering, like space, and inherently free of affliction.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་མི་སླུ་བ་ཡིན་ནོ། །
en: In this way, bodhisattva great beings do not disappoint the blessed buddhas.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The Blessed One, bestowing his approval on what Mañjuśrī­kumāra­bhūta had explained, said

source: འཇམ་དཔལ་ལེགས་སོ་ལེགས་སོ། །
en: “Excellent, Mañjuśrī­kumāra­bhūta, excellent.

source: ཁྱོད་ཀྱི་ཚིག་འདི་ལེགས་པར་སྨྲས་ཏེ།
en: You have put it excellently.

source: དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ལ་སྤྱོད་པ་ཡིན་ཏེ།
en: Bodhisattvas who practice in this way are indeed carrying out bodhisattva practice.

source: ལུང་བསྟན་པ་ཡང་མྱུར་དུ་ཐོབ་པར་འགྱུར་རོ། །
en: They will also swiftly receive their prophecy.

source: འཇམ་དཔལ་ངས་མངོན་པར་ཤེས་ཏེ།
en: Mañjuśrī, I know this clearly.

source: དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱི་སྔོན་རོལ་དུ་དཀར་པོའི་སྤྱོད་པ་གང་ལ་ངས་མ་སྤྱད་པ་ཅི་ཡང་མེད་དེ།
en: Previously, during the time of the Thus-Gone One Dīpaṃkara, there was no virtuous practice I had not already performed.

source: འོན་ཀྱང་ངས་ལུང་བསྟན་པ་མ་ཐོབ་བོ། །
en: However, I did not receive my prophecy.

source: འདི་ལྟར་ངས་མཚན་མ་དང་བཅས་པར་སྤྱད་པ་དང་།
en: Because I was practicing in a conceptual manner;

source: རྩོལ་བ་དང་བཅས་པར་སྤྱད་པ་དང་།
en: I was practicing with effort, and

source: དམིགས་པ་དང་བཅས་པར་སྤྱད་པའི་ཕྱིར་རོ། །
en: practicing in an apprehending manner.

source: གང་གི་ཚེ་ངས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་མཐོང་བའི་ཚེ་སྤྱོད་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་ཏེ།
en: But then, when I met the Thus-Gone One, the foe-destroyer, the completely perfect Buddha Dīpaṃkara, I transcended all practices.

source: མཐོང་མ་ཐག་ཏུ་བཅོམ་ལྡན་འདས་དེའི་སྤྱོད་པ་མཐོང་བ་ངས་ཐོབ་པར་གྱུར་ཅིང་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་མ་སྐྱེས་པ་ཡང་རྟོགས་ཏེ།
en: Just upon seeing him, and witnessing the Blessed One’s conduct, I attained that conduct as well, and realized the fact that all phenomena are inherently unborn.

source: དེ་ནས་གདོད་མ་འོངས་པའི་དུས་ན་ཁྱོད་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་དེས་ལུང་བསྟན་ཏོ། །
en: It was on this occasion that the Blessed Thus-Gone One Dīpaṃkara prophesied, ‘In the future, you will be the thus-gone one, the foe-destroyer, the completely perfect buddha Śākyamuni.’

source: དེ་ཉིད་ཀྱི་ཚེ་ངས་མི་སྐྱེ་བའི་ཆོས་རྣམས་ལ་བཟོད་པ་ཡང་ཐོབ་བོ། །
en: It was at this time, too, that I attained acceptance that all phenomena are unborn.

source: འཇམ་དཔལ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མྱུར་དུ་མི་སྐྱེ་བའི་ཆོས་རྣམས་ལ་བཟོད་པ་ཐོབ་པར་འདོད་པ་རྣམས་ཀྱིས་སྤྱོད་པའི་ལེའུ་འདི་ལ་དམིགས་སུ་མེད་པ་དང་། རྩོལ་བ་མེད་པའི་ཆོས་ལ་མོས་པ་དང་། །
en: “Therefore, Mañjuśrī, those bodhisattva great beings who wish to swiftly attain acceptance that all phenomena are unborn should devote themselves to nonapprehension and effortlessness as described in this discourse on practice;

source: རྣམ་པར་གྲོལ་བ་ལ་སྦྱོར་བར་བྱའོ། །
en: they should apply themselves to liberation.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Mañjuśrī­kumāra­bhūta then asked the Blessed One,

source: བཅོམ་ལྡན་འདས་གང་ཐོབ་པར་བགྱི་བའི་སླད་དུ་བཟོད་པ་བརྙེས་ལགས།
en: “Blessed One, in order to attain what achievements is acceptance attained?”

source: འཇམ་དཔལ་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཐོབ་པར་བྱ་བའི་ཕྱིར་བཟོད་པ་ཐོབ་སྟེ
en: “Mañjuśrī, it is in order to attain the aggregates, the elements, and sense sources that acceptance is attained.

source: དེ་ཡང་ཆོས་ཐམས་ཅད་ཐོབ་པར་བྱ་བའི་ཕྱིར་བཟོད་པ་ཐོབ་བོ། །
en: Moreover, Mañjuśrī, it is in order to attain all phenomena that acceptance is attained.

source: འཇམ་དཔལ་བཟོད་པ་ཐོབ་ཅེས་བྱ་བ་དེ་ནི་མི་ཟད་པའི་ཆོས་ཉིད་དེ་ཐོབ་པའོ། །
en: Mañjuśrī, what is called attaining acceptance is to attain their unending true nature.

source: འཇམ་དཔལ་བཟོད་པ་ཐོབ་ཅེས་བྱ་བ་དེ་ནི་ཡང་དག་པ་ཉིད་ཀྱི་ཚིག་བླ་དགས་སོ། །
en: Mañjuśrī, what is called attaining acceptance is a reference to what is genuinely true.

source: འཇམ་དཔལ་བཟོད་པ་ཐོབ་པ་དེ་ལ་ནི་འཇིག་རྟེན་གྱི་ཆོས་རྣམས་ཀུན་ཏུ་སྤྱོད་པ་མེད་དོ། །
en: Mañjuśrī, attaining acceptance is not to involve oneself in mundane things.

source: སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་དང་། སློབ་པའི་ཆོས་རྣམས་དང་། མི་སློབ་པའི་ཆོས་རྣམས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀུན་ཏུ་སྤྱོད་པ་མེད་དོ། །
en: It is to be uninvolved in the phenomena of ordinary beings; the qualities of training and of nontraining; or the qualities of solitary buddhas, of bodhisattvas, or of buddhas.

source: ཆོས་ཐམས་ཅད་ཀུན་ཏུ་མི་སྤྱོད་པས་ན་དེའི་ཕྱིར་དེ་ལ་བཟོད་པ་ཐོབ་པ་ཞེས་བྱའོ། །
en: In fact it is called attaining acceptance because there is no involvement with any phenomena.

source: བཟོད་པ་དེ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་མཚན་མ་དང་། དམིགས་པ་རྣམས་ཀྱི་སྒོ་ནས་སྐད་ཅིག་པ་མ་ཡིན་ཏེ། དེ་བས་ན་བཟོད་པ་ཞེས་བྱའོ། །
en: Acceptance is so called because it is not just momentary, in terms of the characteristics of all phenomena and their apprehension.

source: བཟོད་པ་འདི་ལ་ནི་མིག་དང་། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་དུ་བགྲང་བ་ཅི་ཡང་མེད་དོ། །
en: This acceptance has nothing whatsoever that can be considered to do with the eyes, ears, nose, tongue, body, or mind.

source: རློམ་སེམས་སུ་བྱ་བ་ཡང་མེད་དོ། །
en: It has nothing to do with pretense.

source: ཟད་པ་ཡང་མེད་དེ། བཟོད་པ་དེ་ལ་ནི་ཟད་པ་ཡང་མེད་དོ། །
en: Not only is it unending, that acceptance also has no end.

source: བཟོད་པ་དེ་ལ་ནི་ཡུལ་ཡང་མེད་དོ། །
en: Not only does that acceptance have no object,

source: བཟོད་པ་དེ་ལ་ནི་ཡུལ་དང་བྲལ་བ་ཡང་མེད་དེ།
en: it is also not without an object.

source: དེ་བས་ན་བཟོད་པ་ཞེས་བྱའོ། །
en: That is why it is called acceptance.”

source: བཟོད་པ་བསྟན་པ་འདི་བཤད་པ་ན། བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་སྟེ།
en: When this teaching on acceptance was given, five hundred bodhisattvas attained acceptance that all phenomena are unborn,

source: ཚིག་འདི་སྐད་དུ་བདག་ཅག་གིས་ནི་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་གནས་པར་འགྱུར་བའི་བྱ་བ་བྱས་སོ། །
en: and declared, “We will strive to preserve this absorption that encapsulates all merit.

source: དཔེ་མེད་པའི་ཆོས་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བྱས་སོ། །
en: We will perfect all its incomparable qualities.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ནི་ཟབ་མོའི་གནས་ཐམས་ཅད་གུས་པར་མཉན་པར་བྱའོ། །
en: Blessed One, bodhisattvas should respectfully learn all its profound topics and put them into practice.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྲེད་མེད་ཀྱི་བུས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Bodhisattva Nārāyaṇa then asked Mañjuśrī­kumāra­bhūta,

source: འཇམ་དཔལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་ཟབ་མོ་འདི་དག་ལ་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཡིན།
en: “Mañjuśrī, how do bodhisattva great beings become trained in these profound teachings?”

source: སྲེད་མེད་ཀྱི་བུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཆོས་ཐམས་ཅད་མ་བྱས་པ་དང་། མ་བསྒྱུར་བར་ཤེས་ན་སྲེད་མེད་ཀྱི་བུ་དེ་ཙམ་གྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཡིན་ནོ། །
en: “Nārāyaṇa, when bodhisattvas know that all phenomena are uncreated and unchanging, simply by so knowing, Nārāyaṇa, those bodhisattvas have become trained in these teachings.

source: གང་གི་ཚེ་ཆོས་ཐམས་ཅད་མངོན་པར་འདུས་མ་བྱས་པར་ཤེས་པ་དང་། བྱས་པ་ལ་མི་འགྱོད་པ་དང་། མ་བྱས་པ་ལ་ཡང་རྨོངས་པ་མེད་ན་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཡིན་ནོ། །
en: When they know that all phenomena are uncompounded, and have no regret about what they have done or confusion about what they have not done, those bodhisattvas have become trained in these profound teachings.

source: བྱ་བ་ལ་ཡང་སྦྱོར་བ་དང་། བྱས་པ་ལ་བྱས་པ་མི་གཟོ་བ་ལས་བྱས་པ་གཟོ་བར་བྱེད་པ་དང་།
en: They have become trained when they carry out their activities, when they acknowledge what they have done instead of failing to acknowledge it,

source: བཀུར་སྟི་བྱས་པ་དང་། བཀུར་སྟི་མ་བྱས་པས་ཀྱང་སྲོ་སོས་པ་དང་། སྲོ་ཤི་བར་མི་འགྱུར་བ་དང་།
en: when they do not become elated if respected, or disheartened if disrespected, and

source: བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་ཡང་མི་དམིགས་ལ།
en: when they do not apprehend a doer or someone who experiences.

source: ཡོངས་སུ་སྦྱང་བ་ཡང་བྱས་པ་དང་། སྦྱིན་པ་ཡང་སྦྱིན་ཞིང་། དེ་ཡང་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བར་བྱེད་ལ་ཡོངས་སུ་སྦྱང་བ་ཡང་བྱས་པ་དང་།
en: They have become thoroughly trained when they give generously and then dedicate that generosity toward awakening.

source: སྦྱིན་པ་དང་། བྱང་ཆུབ་དང་། བདག་དང་། ཕ་རོལ་ཀྱང་མི་དམིགས་ལ།
en: They have become trained when they do not apprehend generosity, awakening, a self, or another.

source: ཡོངས་སུ་སྦྱང་བ་ཡང་བྱས་པ་དང་། ཚུལ་ཁྲིམས་ཀྱང་སྲུང་བར་བྱེད། བཟོད་པ་ཡང་སྒོམ་པར་བྱེད། བརྩོན་འགྲུས་ཀྱང་རྩོམ་པར་བྱེད། བསམ་གཏན་ཡང་སྟེན་པར་བྱེད། ཤེས་རབ་ཀྱང་སྒོམ་པར་བྱེད་ཅིང་བྱང་ཆུབ་ཏུ་ཡང་ཡོངས་སུ་སྔོ་བར་བྱེད་ལ། ཤེས་རབ་དེ་ཡང་དམིགས་པར་མི་བྱེད།
en: They have become trained, too, when they maintain discipline, practice patience, foster diligence, apply concentration, cultivate insight, and dedicate these toward awakening, yet do not apprehend that insight or the other.

source: བྱང་ཆུབ་དང་། བདག་དང་། ཕ་རོལ་ཡང་དམིགས་པར་མི་བྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནི་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཡིན་པར་རིག་པར་བྱའོ། །
en: Thus should you understand that bodhisattvas, when they do not apprehend awakening, a self, or another, have become trained.

source: ལུས་དང་ངག་དང་ཡིད་ཀྱི་དགེ་བ་རྣམས་མི་དམིགས་པ་གང་ཡིན་པ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཡིན་ནོ། །
en: Bodhisattvas who do not apprehend their physical, verbal, and mental virtue, also, have become trained.

source: ལུས་དང་ངག་དང་ཡིད་ཀྱི་ཚོགས་ལ་མཁས་པ་མི་དམིགས་པ་གང་ཡིན་པ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཡིན་ནོ། །
en: Bodhisattvas who do not apprehend their skill in the physical, verbal, and mental accumulations, too, have become trained.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་བརྩོན་འགྲུས་བརྟན་གྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then Bodhisattva Constant Stable Diligence said to Mañjuśrī­kumāra­bhūta,

source: འཇམ་དཔལ་བདག་ཀྱང་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཡིན་པ་ལ་སྤོབས་སོ། །
en: “Mañjuśrī, I too have become inspired to speak about how bodhisattvas become thoroughly trained.”

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེའི་དུས་ལ་ད་བབ་པར་ཤེས་ན་སྤོབས་པར་གྱིས་ཤིག །
en: “Son of noble family, if you know it is the right time, please express your inspiration.”

source: བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་བརྩོན་པ་བརྟན་གྱིས་སྨྲས་པ།
en: Bodhisattva Constant Stable Diligence then proceeded,

source: འཇམ་དཔལ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔས་ཐ་ན་སེམས་ཅན་གཅིག་ཙམ་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་འཇུག་པར་བྱེད་ན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཡིན་ནོ། །
en: “Mañjuśrī, bodhisattvas have become trained when they cause even one being to enter the Buddha’s teachings.

source: གང་གི་ཟས་ཟ་བའམ། གང་ལས་ལེན་པར་བྱེད་པའམ། གང་ལ་སྦྱིན་པར་བྱེད་པ་དེ་དག་བྱང་ཆུབ་ལ་འཛུད་པར་བྱེད་ན། གཉིས་ཀ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་དག་པར་འགྱུར་རོ། །
en: If a bodhisattva is eating food with someone, accepting something from someone, or giving something to someone, and draws that person toward awakening, then both of them receive the bodhisattva’s pure benefit.

source: ཆོས་སྒྲུབ་པ་ལ་བཙུད་ན་ཡང་སྦྱིན་པ་པོ་དང་། ལེན་པ་པོ་གཉིས་ཀ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་དག་པར་འགྱུར་རོ། །
en: If a bodhisattva draws someone into spiritual practice, then both the giver and recipient receive the bodhisattva’s pure benefit.

source: གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་གཞན་དག་ལ་སངས་རྒྱས་ཀྱི་སྒྲ་སྒྲོགས་པར་བྱེད་ཅིང་། ཆོས་ཀྱི་སྒྲ་དང་། དགེ་འདུན་གྱི་སྒྲ་སྒྲོགས་པར་བྱེད་ལ། བདག་ཉིད་ཀྱང་། སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་རྗེས་སུ་དྲན་བཞིན་དུ་སྦྱིན་པ་སྦྱིན་པར་བྱེད་པ་དང་། སྦྱིན་པའམ། ཚུལ་ཁྲིམས་སམ། བཟོད་པའམ། བརྩོན་འགྲུས་སམ། བསམ་གཏན་ནམ། ཤེས་རབ་ཡིད་ལ་བྱེད་དམ། གཞན་དག་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་སྒྲོགས་པར་བྱེད་ཅིང་། སེམས་ཅན་རྣམས་ལ་སེམས་པར་བྱེད་ལ། དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་དེ་དག་དང་ཐུན་མོང་དུ་བྱས་ནས
en: The root of virtue is always shared with others whenever a bodhisattva proclaims the words Buddha, Dharma, and Saṅgha to others; or when he brings the Buddha, Dharma, and Saṅgha to mind while making a gift; or when he mentally cultivates generosity, discipline, patience, diligence, concentration, or insight; or when he proclaims these six perfections to others and causes those beings to reflect on them.

source: བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བར་བྱེད་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཡིན་ཏེ། དེའི་ཚེ་ཟས་ལོངས་སྤྱོད་པའི་འོས་ཡིན་ནོ། །
en: If he carries all this out and then dedicates it toward awakening, the bodhisattva has become trained, and that food has become suitable for consumption.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་བཟོད་པ་སྒོམ་པ་ན། ཆོམ་རྐུན་པ་རྣམས་དང་། རིགས་ངན་ཡན་ཆད་ཀྱིས་སྤྱོས་ཤིང་བརྒྱད་བཀག་ཀྱང་འཁྲུག་པར་མི་འགྱུར།
en: “When practicing patience, bodhisattvas do not become disturbed, even if thieves and brutes insult and revile them.

source: གནོད་སེམས་མི་བྱེད་དེ། སེམས་ཅན་དེ་དག་ཉིད་ཀྱི་དགའ་བ་བསྐྱེད་པའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་ཞིང་། སྟོབས་དང་། བརྩོན་འགྲུས་དང་། མཐུ་ཆེན་པོ་སྐྱེད་པར་བྱེད་ན།
en: They do not harbor ill will, either, and in order to make such beings happy, they cultivate diligence and give rise to strength, diligence, and great power.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཡིན་པར་རིག་པར་བྱའོ། །
en: One should understand that in doing so, they have become trained in bodhisattva practice.

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་དབྱིག་བྱེ་བ་ཕྲག་བརྒྱའམ། གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་དབྱིག་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བཀང་བ་བྱིན་ཏེ། བྲིད་ན་ཡང་ཤེས་བཞིན་དུ་བརྫུན་དུ་མི་སྨྲ་ལ།
en: “Though someone may try to entice them by giving them a billion gold coins, or even a four-continent world system filled with gold coins, bodhisattvas will remain vigilant and not tell lies.

source: གཞན་དག་གིས་ཆོས་དྲིས་ན་ཡང་གཟིང་གཟིང་བའི་ཚིག་མི་སྨྲ་ཞིང་།
en: If someone should request a teaching, they will not respond with deceptive statements.

source: ཆོས་ལ་སྐུར་པ་བཏབ་ནས། ཆོས་མ་ཡིན་པར་སྨྲ་བར་མི་བྱེད་ན་
en: Nor, if someone should denigrate the Dharma, will they respond in a nonspiritual manner.

source: བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཡིན་པར་རིག་པར་བྱའོ། །
en: One should understand that bodhisattvas who act in these ways have been trained.

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཞག་བདུན་གྱི་བར་དུ་ཟན་ཆད་ནས་ཁ་ཟས་བསྟབས་ན་ཡང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་འབའ་ཞིག་དེ་ལ་མངོན་དུ་འགྱུར་ཞིང་། སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་དགྲོལ་བར་བྱ་བ་འབའ་ཞིག་གི་ཕྱིར་དེ་ལ་བྱང་ཆུབ་ཀྱི་སེམས་མངོན་དུ་འགྱུར་ན
en: “If bodhisattvas have been fasting for seven days, though someone may offer them a meal, they will only maintain the mind of omniscience, and will actualize the mind of awakening, which is solely in order to liberate all beings.

source: འཇམ་དཔལ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཉན་པའི་ཕྱིར་ས་གཞི་མཚོན་ཆ་གཏམས་པའམ། མེས་གང་བ་རྒལ་ཏེ་འགྲོ་བར་བྱེད་ལ། ལུས་ཕངས་པའམ། སྲོག་ཕངས་པར་མི་བྱེད་དེ
en: “Furthermore, Mañjuśrī, in order to hear the Dharma, bodhisattvas are ready to cross the entire earth, even if it were covered with swords or filled with fire, with no concern for life or limb.

source: ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་རྣམས་ནི་རྙེད་པར་སླའི། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་རྙེད་པར་དཀའོ། །
en: They would reflect, ‘Aggregates, elements, and sense sources are easy to acquire, but it is not easy to encounter the blessed buddhas.

source: ཆོས་སྟོན་པ་ནི་རྙེད་པར་དཀའོ། །
en: It is not easy to find a Dharma teacher,

source: ཆོས་ལ་གུས་པའི་སེམས་ཅན་དག་ཀྱང་རྙེད་པར་དཀའོ། །
en: and not easy to find beings who respect the Dharma.’

source: སྙམ་དུ་དེ་ལྟར་ཡང་སློབ་སྟེ།
en: With this in mind, they would train accordingly.

source: གལ་ཏེ་དེ་ལྟ་བུར་འཛིན་པ་ལ་ཞུགས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཡིན་པར་རིག་པར་བྱའོ། །
en: One should understand that when bodhisattvas have espoused this kind of tenacity, they have become thoroughly trained.

source: འཇམ་དཔལ་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་གཅིག་གམ། སྡོམ་པའམ། ཆོས་ཀྱི་གདམས་ངག་གིས་ནི་ཆེས་ཡི་རངས་པར་འགྱུར་ལ། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ཀྱིས་ནི་ཡི་རངས་པར་མི་འགྱུར་བ་དང་། །སེམས་ཅན་གཅིག་ལ་ཡང་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་བསྒྲགས་པས་ནི་ཆེས་ཡི་རངས་པར་འགྱུར་ལ། བརྒྱ་བྱིན་དུ་འགྱུར་བ་ཐོབ་པས་ནི་དེ་ལྟ་མ་ཡིན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཡིན་ནོ། །
en: “In addition, Mañjuśrī, one should understand that bodhisattvas have become thoroughly trained when to have one four-line verse, a summary, or a spiritual instruction makes them extremely joyful, but to have a wheel-bearing monarch’s royal dominion brings them no joy. Or when sharing a four-line verse of scripture with even a single being makes feel extremely joyful, but attaining the state of Śakra has no such effect.

source: འཇམ་དཔལ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གྱུར་པ་ཁྱི་ལ་སྦྱིན་པ་བྱེད་པས་ནི་ཆེས་ཡི་རངས་པར་འགྱུར་ལ། ཚངས་པར་འགྱུར་བ་ཐོབ་པས་ནི་མ་ཡིན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཡིན་པར་རིག་པར་བྱའོ། །
en: “Also, Mañjuśrī, one should understand that bodhisattvas have become thoroughly trained when being generous to a being who has taken rebirth as an animal, such as a dog, makes them extremely joyful, but achieving the state of Brahmā does not.

source: འཇམ་དཔལ་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཐོས་པ་ལ་གནས་པའི་རྙེད་པ་གཅིག་ཅིག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པས་ནི་ཆེས་ཡི་རངས་པར་འགྱུར་ལ། ནོར་གྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པས་ནི་དེ་ལྟ་མ་ཡིན་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་ཀྱིས་ནི་ཆེས་ཡི་རངས་པར་འགྱུར་ལ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ཡོངས་སུ་བཀང་བས་ནི་དེ་ལྟ་མ་ཡིན་པ་དང་། དགེ་བའི་རྩ་བ་གཅིག་ཅིག་སེམས་ཀྱིས་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པས། བྱང་ཆུབ་ཏུ་དམིགས་པ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བའི་ཕྱིར་ཡོངས་སུ་བསྔོས་པས་ནི་ཆེས་ཡི་རངས་པར་འགྱུར་ལ། རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་ཐམས་ཅད་ཀྱིས་ནི་ཡི་རངས་པར་མི་འགྱུར་ཏེདེ་ལྟར་སྤྱོད་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཡིན་པར་རིག་པར་བྱའོ། །
en: “Moreover, Mañjuśrī, one should understand that bodhisattvas have become thoroughly trained when dedicating what they have discovered through learning toward the state of omniscience makes them extremely joyful, yet an unfathomable quantity of jewels does not. Or when the mind of omniscience makes them extremely joyful, yet a great trichiliocosm filled with the seven precious materials does not. Or when mentally dedicating one root of virtue toward awakening—focusing on awakening while dedicating it to the aid and happiness of all beings—makes them extremely joyful, but gain, honor, and eulogy in any regard do not.

source: འཇམ་དཔལ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔས་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་རྟག་ཏུ་བརྩོན་པར་བྱའོ། །
en: “Furthermore, Mañjuśrī, bodhisattvas should always strive to bring beings to maturity.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་ཐོས་པ་མང་པོ་བཙལ་བའི་ཕྱིར་མཐུ་རྩལ་བརྟན་པོར་བྱའོ། །
en: Bodhisattvas should have the firm fortitude necessary to pursue extensive knowledge.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་ཡན་ལག་དང་། ཉིང་ལག་ཡོངས་སུ་གཏང་བས་མཐུ་དང་ལྡན་པར་བྱའོ། །
en: Bodhisattvas should have the fortitude to give up every part of their bodies.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་འཇིག་རྟེན་གྱི་ཆོས་རྣམས་དང་དུ་ལེན་པར་སྤྲོ་བར་བྱའོ། །
en: Bodhisattvas should accept worldly things cheerfully.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སྲོག་གི་ཕྱིར་ཡང་བསླབ་པ་ཡོངས་སུ་མི་གཏང་བས་སྤྱོད་པ་ལ་བློ་དང་ལྡན་པར་བྱའོ། །
en: Bodhisattvas should never give up their training, even at the cost of their lives; they should be intelligent in their conduct.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་ངན་དུ་སྨྲས་པའི་ཚིག་དང་དུ་ལེན་པའི་ངང་ཚུལ་ཅན་གྱིས་བཟོད་པའི་སྟོབས་དང་ལྡན་པར་བྱའོ། །
en: Bodhisattvas should have the strength of patience and maintain a tolerant disposition in the face of offensive words.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཡོངས་སུ་གཟུང་བས་ལེ་ལོ་མེད་པར་བྱའོ། །
en: Bodhisattvas should be without laziness, keeping the perfectly pure buddhafields in mind.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་བྱང་ཆུབ་ཀྱི་སེམས་དང་མི་འབྲལ་བས་རྩེ་གཅིག་ཏུ་བྱའོ། །
en: Bodhisattvas should have the one-pointed determination never to be apart from the mind of awakening.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་བཙལ་བས་བྱང་ཆུབ་ཀྱི་སེམས་མི་བརྗེད་པར་བྱའོ། །
en: Endeavoring in the six perfections, bodhisattvas should never forget the mind of awakening.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་རང་གི་དོན་ལ་བརྩོན་པ་དང་ལྡན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏང་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐབས་དབྱེ་བའི་ཕྱིར་མི་འཕྲོགས་པར་བྱའོ། །
en: Bodhisattvas should be unflagging in persistence in their own objectives, in not forsaking any being, and in distinguishing the circumstances of all beings.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སངས་རྒྱས་ཀྱི་རིགས་མི་འཆད་པར་བྱ་བའི་ཕྱིར་དམ་བཅས་པ་ལ་བརྟན་པར་བྱའོ། །
en: “Bodhisattvas should be steadfast in their vow to preserve the Buddha’s lineage.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་ལུས་དང་ངག་དང་ཡིད་དྲང་པོ་ཡོངས་སུ་དག་པས་གཡོ་ཐམས་ཅད་ཡོངས་སུ་སྤང་བར་བྱའོ། །
en: Bodhisattvas should be completely honest in body, speech, and mind, avoiding deceit in every respect.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སེམས་ཅན་སྐྱབས་སུ་འོངས་པ་ཡོངས་སུ་བསྐྱབ་པའི་ཕྱིར་ཤིན་ཏུ་དཀར་བའི་ཕྱོགས་གཅིག་ཏུ་ངེས་པར་བྱའོ། །
en: Bodhisattvas should be intent solely on what is wholly virtuous in order to safeguard those beings who come for refuge.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་ལུས་དང་སྲོག་ལ་མ་ཆགས་པས་མི་བལྟ་བར་བྱའོ། །
en: Bodhisattvas should have no attachment and concern for their bodies and lives.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་ཚུར་ཤོག་འོངས་པ་ལེགས་སོ་ཞེས་སྨྲ་བས་འཇམ་པོར་བྱའོ། །
en: Bodhisattvas should be gentle and welcoming to visitors.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་ཁྲོ་གཉེར་མེད་པའི་བཞིན་གྱིས་གསོང་པོར་སྨྲ་བར་བྱའོ། །
en: Bodhisattvas should speak sincerely without frowning.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་མེད་པས་ས་དང་འདྲ་བར་བྱའོ། །
en: Bodhisattvas should be like the earth, without attachment or anger.
